jumbotoursbd/certification/booking3/ValuateRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xtravelsystem.com/v1_0rc1/hotel/types">
    <soapenv:Header/>
    <soapenv:Body>
        <typ:valuateExtendsV22>
            <ValuationRQV22_1>
                <agencyCode>266333</agencyCode>
                <brandCode>1</brandCode>
                <pointOfSaleId>1</pointOfSaleId>
                <checkin>2020-11-01T00:00:00.000Z</checkin>
                <checkout>2020-11-02T00:00:00.000Z</checkout>
                <establishmentId>3188</establishmentId>
                <language>en</language>
                <occupancies>
                    <adults>2</adults>
                    <children>1</children>
                    <childrenAges>5</childrenAges>
                    <numberOfRooms>1</numberOfRooms>
                    <ratePlanCode>ZB1:BB:NET::MeTsZQZGY0NWE0OWYtYmU5NC00MWE4LTliMDAtNTA4NjU0ZWIyODE2IyZAJiMzMTg4</ratePlanCode>
                </occupancies>
                <extendedLogin>
                    <channel>B2B</channel>
                    <loginCountry>GB</loginCountry>
                    <mainNationality>GB</mainNationality>
                </extendedLogin>
                <paxNationalities>
                    <nationality></nationality>
                </paxNationalities>
            </ValuationRQV22_1>
        </typ:valuateExtendsV22>
    </soapenv:Body>
</soapenv:Envelope>